Case/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{   
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (2 0 0)
    (3 0 0)
    (4 0 0)
    (0 1 0)
    (1 1 0)
    (2 1 0)
    (3 1 0)
    (4 1 0)
    (0 3 0)
    (1 3 0)
    (2 3 0)
    (3 3 0)
    (4 3 0)
    (0 4 0)
    (1 4 0)
    (2 4 0)
    (3 4 0)
    (4 4 0)
    (0 0 1)
    (1 0 1)
    (2 0 1)
    (3 0 1)
    (4 0 1)
    (0 1 1)
    (1 1 1)
    (2 1 1)
    (3 1 1)
    (4 1 1)
    (0 3 1)
    (1 3 1)
    (2 3 1)
    (3 3 1)
    (4 3 1)
    (0 4 1)
    (1 4 1)
    (2 4 1)
    (3 4 1)
    (4 4 1)
);

blocks
(
    hex (0 1 6 5 20 21 26 25) block_0_0 (10 10 10) simpleGrading (1 1 1)
    hex (1 2 7 6 21 22 27 26) block_1_0 (10 10 10) simpleGrading (1 1 1)
    hex (2 3 8 7 22 23 28 27) block_2_0 (10 10 10) simpleGrading (1 1 1)
    hex (3 4 9 8 23 24 29 28) block_3_0 (10 10 10) simpleGrading (1 1 1)
    hex (5 6 11 10 25 26 31 30) block_0_1 (10 20 10) simpleGrading (1 1 1)
    hex (6 7 12 11 26 27 32 31) block_1_1 (10 20 10) simpleGrading (1 1 1)
    hex (7 8 13 12 27 28 33 32) block_2_1 (10 20 10) simpleGrading (1 1 1)
    hex (8 9 14 13 28 29 34 33) block_3_1 (10 20 10) simpleGrading (1 1 1)
    hex (10 11 16 15 30 31 36 35) block_0_2 (10 10 10) simpleGrading (1 1 1)
    hex (11 12 17 16 31 32 37 36) block_1_2 (10 10 10) simpleGrading (1 1 1)
    hex (12 13 18 17 32 33 38 37) block_2_2 (10 10 10) simpleGrading (1 1 1)
    hex (13 14 19 18 33 34 39 38) block_3_2 (10 10 10) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (15 16 36 35)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (18 19 39 38)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 5 25 20)
            (4 9 29 24)
            (5 10 30 25)
            (9 14 34 29)
            (10 15 35 30)
            (14 19 39 34)
            (0 1 21 20)
            (1 2 22 21)
            (2 3 23 22)
            (3 4 24 23)
            (16 17 37 36)
            (17 18 38 37)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 6 5)
            (1 2 7 6)
            (2 3 8 7)
            (3 4 9 8)
            (5 6 11 10)
            (6 7 12 11)
            (7 8 13 12)
            (8 9 14 13)
            (10 11 16 15)
            (11 12 17 16)
            (12 13 18 17)
            (13 14 19 18)
        );
    }
    top
    {
        type wall;
        faces
        (
            (20 21 26 25)
            (21 22 27 26)
            (22 23 28 27)
            (23 24 29 28)
            (25 26 31 30)
            (26 27 32 31)
            (27 28 33 32)
            (28 29 34 33)
            (30 31 36 35)
            (31 32 37 36)
            (32 33 38 37)
            (33 34 39 38)
        );
    }
);

